//ここで入力される文字を決定するためのリストを格納している。
//このリストの配置は”2タッチ入力 - Wikipedia”内の”文字の割り当て”( https://ja.wikipedia.org/wiki/2タッチ入力 )を参考にした。(ただし、表中の’機’の部分は空白とした。)

public class Character {
    char[] WLine	= {'0', 'わ', 'を', 'ん', '゛', '゜', '6', '7', '8', '9'};
    char[] ALine	= {'E', 'あ', 'い', 'う', 'え', 'お', 'A', 'B', 'C', 'D'};
    char[] KLine	= {'J', 'か', 'き', 'く', 'け', 'こ', 'F', 'G', 'H', 'I'};
    char[] SLine	= {'O', 'さ', 'し', 'す', 'せ', 'そ', 'K', 'L', 'M', 'N'};
    char[] TLine	= {'T', 'た', 'ち', 'つ', 'て', 'と', 'P', 'Q', 'R', 'S'};
    char[] NLine	= {'Y', 'な', 'に', 'ぬ', 'ね', 'の', 'U', 'V', 'W', 'X'};
    char[] HLine	= {'/', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'Z', '?', '!', '-'};
    char[] MLine	= {' ', 'ま', 'み', 'む', 'め', 'も', '¥', '&', ' ', ' '};
    char[] YLine	= {' ', 'や', '(', 'ゆ', ')', 'よ', '*', '#', ' ', ' '};
    char[] RLine	= {'5', 'ら', 'り', 'る', 'れ', 'ろ', '1', '2', '3', '4'};

}
